***Import Pandas Library***

In [232]:
import pandas as pd

***Read CSV File Using Pandas Library***

In [233]:
dataframe = pd.read_csv("example.csv")

In [234]:
dataframe

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"ALLISON, PAUL W",LIEUTENANT,FIRE,F,Salary,NaN,"$107,790.00",NaN
1,"BRUNO, KEVIN D",SERGEANT,POLICE,F,Salary,NaN,"$104,628.00",NaN
2,"COOPER, JOHN E",LIEUTENANT-EMT,FIRE,F,Salary,NaN,"$114,324.00",NaN
3,"CRESPO, VILMA I",STAFF ASST,LAW,F,Salary,NaN,"$76,932.00",NaN
4,"DOLAN, ROBERT J",SERGEANT,POLICE,F,Salary,NaN,"$111,474.00",NaN
...,...,...,...,...,...,...,...,...
32653,"ZYGOWICZ, PETER J",POLICE OFFICER,POLICE,F,Salary,NaN,"$90,024.00",NaN
32654,"ZYLINSKA, KATARZYNA",POLICE OFFICER,POLICE,F,Salary,NaN,"$48,078.00",NaN
32655,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,F,Salary,NaN,"$87,006.00",NaN
32656,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,F,Salary,NaN,"$93,354.00",NaN
32657,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,F,Salary,NaN,"$115,932.00",NaN

***Show first five records from this dataframe***

In [235]:
dataframe.head()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"ALLISON, PAUL W",LIEUTENANT,FIRE,F,Salary,NaN,"$107,790.00",NaN
1,"BRUNO, KEVIN D",SERGEANT,POLICE,F,Salary,NaN,"$104,628.00",NaN
2,"COOPER, JOHN E",LIEUTENANT-EMT,FIRE,F,Salary,NaN,"$114,324.00",NaN
3,"CRESPO, VILMA I",STAFF ASST,LAW,F,Salary,NaN,"$76,932.00",NaN
4,"DOLAN, ROBERT J",SERGEANT,POLICE,F,Salary,NaN,"$111,474.00",NaN

***Show last five records from this dataframe***

In [236]:
dataframe.tail()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
32653,"ZYGOWICZ, PETER J",POLICE OFFICER,POLICE,F,Salary,NaN,"$90,024.00",NaN
32654,"ZYLINSKA, KATARZYNA",POLICE OFFICER,POLICE,F,Salary,NaN,"$48,078.00",NaN
32655,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,F,Salary,NaN,"$87,006.00",NaN
32656,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,F,Salary,NaN,"$93,354.00",NaN
32657,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,F,Salary,NaN,"$115,932.00",NaN

***Show the overview in this dataframe***

In [237]:
dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32658 entries, 0 to 32657
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Name               32658 non-null  object
 1   Job Titles         32658 non-null  object
 2   Department         32658 non-null  object
 3   Full or Part-Time  32658 non-null  object
 4   Salary or Hourly   32658 non-null  object
 5   Typical Hours      7883 non-null   float64
 6   Annual Salary      24775 non-null  object
 7   Hourly Rate        7883 non-null   object
dtypes: float64(1), object(7)
memory usage: 2.0+ MB

***Show how many 'NaN' values are present in each column.***

In [238]:
dataframe.isnull()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,False,False,False,False,False,True,False,True
1,False,False,False,False,False,True,False,True
2,False,False,False,False,False,True,False,True
3,False,False,False,False,False,True,False,True
4,False,False,False,False,False,True,False,True
...,...,...,...,...,...,...,...,...
32653,False,False,False,False,False,True,False,True
32654,False,False,False,False,False,True,False,True
32655,False,False,False,False,False,True,False,True
32656,False,False,False,False,False,True,False,True
32657,False,False,False,False,False,True,False,True

In [239]:
dataframe.isnull().sum()

Name                     0
Job Titles               0
Department               0
Full or Part-Time        0
Salary or Hourly         0
Typical Hours        24775
Annual Salary         7883
Hourly Rate          24775
dtype: int64

***Shorted Value ascending & descending***

In [240]:
print("......Show Ascending Values......")
print(dataframe.isnull().sum().sort_values(ascending=True))
print("......Show Descending Values......")
print(dataframe.isnull().sum().sort_values(ascending=False))

......Show Ascending Values......
Name                     0
Job Titles               0
Department               0
Full or Part-Time        0
Salary or Hourly         0
Annual Salary         7883
Typical Hours        24775
Hourly Rate          24775
dtype: int64
......Show Descending Values......
Hourly Rate          24775
Typical Hours        24775
Annual Salary         7883
Name                     0
Full or Part-Time        0
Department               0
Job Titles               0
Salary or Hourly         0
dtype: int64

***Generate a summary of dataset statistics. (Only Numarical Data)***

In [241]:
dataframe.describe()

       Typical Hours
count    7883.000000
mean       34.698719
std         9.145553
min        10.000000
25%        20.000000
50%        40.000000
75%        40.000000
max        40.000000

***Generate a summary of dataset statistics. (All Data)***

In [242]:
dataframe.describe(include="all")

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
count,32658,32658,32658,32658,32658,7883.000000,24775,7883
unique,32350,1095,36,2,2,NaN,1038,167
top,"HERNANDEZ, JUAN C",POLICE OFFICER,POLICE,F,Salary,NaN,"$90,024.00",$35.60
freq,5,9393,12973,30676,24775,NaN,2368,1404
mean,NaN,NaN,NaN,NaN,NaN,34.698719,NaN,NaN
std,NaN,NaN,NaN,NaN,NaN,9.145553,NaN,NaN
min,NaN,NaN,NaN,NaN,NaN,10.000000,NaN,NaN
25%,NaN,NaN,NaN,NaN,NaN,20.000000,NaN,NaN
50%,NaN,NaN,NaN,NaN,NaN,40.000000,NaN,NaN
75%,NaN,NaN,NaN,NaN,NaN,40.000000,NaN,NaN
max,NaN,NaN,NaN,NaN,NaN,40.000000,NaN,NaN

***Find the maximum, minimum, and average values of the ‘Typical Hours’ column.***

In [243]:
dataframe["Typical Hours"].min()

np.float64(10.0)

In [244]:
dataframe["Typical Hours"].max()

np.float64(40.0)

In [245]:
dataframe["Typical Hours"].mean()

np.float64(34.69871876189268)

***How many employees are salaried and how many are paid hourly?***

In [246]:
dataframe["Salary or Hourly"]

0        Salary
1        Salary
2        Salary
3        Salary
4        Salary
          ...
32653    Salary
32654    Salary
32655    Salary
32656    Salary
32657    Salary
Name: Salary or Hourly, Length: 32658, dtype: object

In [247]:
dataframe[["Salary or Hourly"]]

      Salary or Hourly
0               Salary
1               Salary
2               Salary
3               Salary
4               Salary
...                ...
32653           Salary
32654           Salary
32655           Salary
32656           Salary
32657           Salary

[32658 rows x 1 columns]

In [248]:
dataframe.groupby("Salary or Hourly").count()["Name"]

Salary or Hourly
Hourly     7883
Salary    24775
Name: Name, dtype: int64

***Which department has the highest number of employees?***

In [249]:
dataframe.groupby("Department").count()["Name"].sort_values(ascending=False).head(1)

Department
POLICE    12973
Name: Name, dtype: int64

In [250]:
dataframe.groupby("Department").count()["Name"].idxmax()

'POLICE'

In [251]:
dataframe["Department"].value_counts().head(1)

Department
POLICE    12973
Name: count, dtype: int64

***In the Police department, how many employees are salaried and how many are hourly?***

In [252]:
dataframe["Department"] == "POLICE"

0        False
1         True
2        False
3        False
4         True
         ...
32653     True
32654     True
32655     True
32656     True
32657    False
Name: Department, Length: 32658, dtype: bool

In [253]:
police_dataframe = dataframe[dataframe["Department"] == "POLICE"]
police_dataframe

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
1,"BRUNO, KEVIN D",SERGEANT,POLICE,F,Salary,NaN,"$104,628.00",NaN
4,"DOLAN, ROBERT J",SERGEANT,POLICE,F,Salary,NaN,"$111,474.00",NaN
7,"ELKINS, ERIC J",SERGEANT,POLICE,F,Salary,NaN,"$104,628.00",NaN
8,"ESTRADA, LUIS F",POLICE OFFICER,POLICE,F,Salary,NaN,"$96,060.00",NaN
9,"EWING, MARIE A",CLERK III,POLICE,F,Salary,NaN,"$53,076.00",NaN
...,...,...,...,...,...,...,...,...
32652,"ZYGMUNT, DAWID",POLICE OFFICER,POLICE,F,Salary,NaN,"$48,078.00",NaN
32653,"ZYGOWICZ, PETER J",POLICE OFFICER,POLICE,F,Salary,NaN,"$90,024.00",NaN
32654,"ZYLINSKA, KATARZYNA",POLICE OFFICER,POLICE,F,Salary,NaN,"$48,078.00",NaN
32655,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,F,Salary,NaN,"$87,006.00",NaN
32656,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,F,Salary,NaN,"$93,354.00",NaN

In [254]:
police_dataframe.groupby("Salary or Hourly").count()["Name"]

Salary or Hourly
Hourly       32
Salary    12941
Name: Name, dtype: int64

In [255]:
police_dataframe["Salary or Hourly"].value_counts()

Salary or Hourly
Salary    12941
Hourly       32
Name: count, dtype: int64

***Find the mean, maximum, and minimum salaries.***

In [256]:
dataframe

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"ALLISON, PAUL W",LIEUTENANT,FIRE,F,Salary,NaN,"$107,790.00",NaN
1,"BRUNO, KEVIN D",SERGEANT,POLICE,F,Salary,NaN,"$104,628.00",NaN
2,"COOPER, JOHN E",LIEUTENANT-EMT,FIRE,F,Salary,NaN,"$114,324.00",NaN
3,"CRESPO, VILMA I",STAFF ASST,LAW,F,Salary,NaN,"$76,932.00",NaN
4,"DOLAN, ROBERT J",SERGEANT,POLICE,F,Salary,NaN,"$111,474.00",NaN
...,...,...,...,...,...,...,...,...
32653,"ZYGOWICZ, PETER J",POLICE OFFICER,POLICE,F,Salary,NaN,"$90,024.00",NaN
32654,"ZYLINSKA, KATARZYNA",POLICE OFFICER,POLICE,F,Salary,NaN,"$48,078.00",NaN
32655,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,F,Salary,NaN,"$87,006.00",NaN
32656,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,F,Salary,NaN,"$93,354.00",NaN
32657,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,F,Salary,NaN,"$115,932.00",NaN

In [257]:
dataframe["Salaries"] = dataframe["Annual Salary"].str.replace("$", "").str.replace(",", "").astype(float)
dataframe[["Salaries"]]

       Salaries
0      107790.0
1      104628.0
2      114324.0
3       76932.0
4      111474.0
...         ...
32653   90024.0
32654   48078.0
32655   87006.0
32656   93354.0
32657  115932.0

[32658 rows x 1 columns]

In [258]:
print("Max Value: ", dataframe["Salaries"].max())
print("Min Value: ", dataframe["Salaries"].min())
print("Avarge Value: ", dataframe["Salaries"].mean())

Max Value:  300000.0
Min Value:  0.96
Avarge Value:  87512.78024137235

***Find an employee who has the maximum salary.***

In [259]:
dataframe["Salaries"]

0        107790.0
1        104628.0
2        114324.0
3         76932.0
4        111474.0
           ...
32653     90024.0
32654     48078.0
32655     87006.0
32656     93354.0
32657    115932.0
Name: Salaries, Length: 32658, dtype: float64

In [260]:
max_salary = dataframe["Salaries"].max()
dataframe[dataframe["Salaries"] == max_salary]

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate,Salaries
8310,"EVANS, GINGER S",COMMISSIONER OF AVIATION,AVIATION,F,Salary,NaN,"$300,000.00",NaN,300000.0

In [261]:
#Using idxmax
dataframe.loc[dataframe["Salaries"].idxmax()]

Name                         EVANS,  GINGER S
Job Titles           COMMISSIONER OF AVIATION
Department                           AVIATION
Full or Part-Time                           F
Salary or Hourly                       Salary
Typical Hours                             NaN
Annual Salary                    $300,000.00
Hourly Rate                               NaN
Salaries                             300000.0
Name: 8310, dtype: object

***Find an employee who has the minimum salary.***

In [262]:
min_salary = dataframe["Salaries"].min()
dataframe[dataframe["Salaries"] == min_salary]

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate,Salaries
15387,"KOCH, STEVEN",ADMINISTRATIVE SECRETARY,MAYOR'S OFFICE,F,Salary,NaN,$0.96,NaN,0.96

In [263]:
#using idxmin()
dataframe.loc[dataframe["Salaries"].idxmin()]

Name                           KOCH,  STEVEN
Job Titles           ADMINISTRATIVE SECRETARY
Department                     MAYOR'S OFFICE
Full or Part-Time                           F
Salary or Hourly                       Salary
Typical Hours                             NaN
Annual Salary                          $0.96
Hourly Rate                               NaN
Salaries                                 0.96
Name: 15387, dtype: object

***What are the mean, max and min Hourly Rate?***

In [264]:
dataframe["H_Rate"] = dataframe["Hourly Rate"].str.replace("$", "").str.replace(",", "").astype(float)
dataframe

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate,Salaries,H_Rate
0,"ALLISON, PAUL W",LIEUTENANT,FIRE,F,Salary,NaN,"$107,790.00",NaN,107790.0,NaN
1,"BRUNO, KEVIN D",SERGEANT,POLICE,F,Salary,NaN,"$104,628.00",NaN,104628.0,NaN
2,"COOPER, JOHN E",LIEUTENANT-EMT,FIRE,F,Salary,NaN,"$114,324.00",NaN,114324.0,NaN
3,"CRESPO, VILMA I",STAFF ASST,LAW,F,Salary,NaN,"$76,932.00",NaN,76932.0,NaN
4,"DOLAN, ROBERT J",SERGEANT,POLICE,F,Salary,NaN,"$111,474.00",NaN,111474.0,NaN
...,...,...,...,...,...,...,...,...,...,...
32653,"ZYGOWICZ, PETER J",POLICE OFFICER,POLICE,F,Salary,NaN,"$90,024.00",NaN,90024.0,NaN
32654,"ZYLINSKA, KATARZYNA",POLICE OFFICER,POLICE,F,Salary,NaN,"$48,078.00",NaN,48078.0,NaN
32655,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,F,Salary,NaN,"$87,006.00",NaN,87006.0,NaN
32656,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,F,Salary,NaN,"$93,354.00",NaN,93354.0,NaN
32657,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,F,Salary,NaN,"$115,932.00",NaN,115932.0,NaN

In [265]:
print('Min H_Rate :', dataframe['H_Rate'].min())
print('Max H_Rate :', dataframe['H_Rate'].max())
print('Average H_Rate :', dataframe['H_Rate'].mean())

Min H_Rate : 2.65
Max H_Rate : 96.0
Average H_Rate : 32.86819231257135

***How many employees are getting max Hourly Rate?***

In [266]:
max_h_rate = dataframe["H_Rate"].max()
dataframe[dataframe["H_Rate"] == max_h_rate].count()["Name"]

np.int64(1)

***Who is getting max Hourly Rate?***

In [267]:
dataframe[dataframe["H_Rate"] == max_h_rate]

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate,Salaries,H_Rate
14317,"JONES, JOHN W",PSYCHIATRIST,HEALTH,F,Hourly,35.0,NaN,$96.00,NaN,96.0

In [268]:
#using idxmax
dataframe.loc[dataframe["H_Rate"].idxmax()]

Name                 JONES,  JOHN W
Job Titles             PSYCHIATRIST
Department                   HEALTH
Full or Part-Time                 F
Salary or Hourly             Hourly
Typical Hours                  35.0
Annual Salary                   NaN
Hourly Rate                 $96.00
Salaries                        NaN
H_Rate                         96.0
Name: 14317, dtype: object

***How many employees are earning less than the average Hourly Rate?***

In [269]:
avg_h_rate = dataframe["H_Rate"].mean()
dataframe[dataframe["H_Rate"] < avg_h_rate].count()["Name"]

np.int64(2791)

***How many employees are paid hourly and they have full-time job?***

In [270]:
hourly_based = dataframe[(dataframe["Salary or Hourly"] == "Hourly") & (dataframe["Full or Part-Time"] == "F")].count()["Name"]
hourly_based

np.int64(5906)

***Find the full-time employees who are working at hourly rate of $10.00?***

In [271]:
dataframe[(dataframe["Full or Part-Time"] == "F") & (dataframe["H_Rate"] == 10)]

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate,Salaries,H_Rate
1232,"AYALA JR, JESUS",STUDENT INTERN,HUMAN RESOURCES,F,Hourly,35.0,NaN,$10.00,NaN,10.0
4522,"CERVANTES, BIANCA A",STUDENT INTERN,BUDGET & MGMT,F,Hourly,35.0,NaN,$10.00,NaN,10.0
6476,"DAVILA, ROBERTO A",ALDERMANIC AIDE,CITY COUNCIL,F,Hourly,35.0,NaN,$10.00,NaN,10.0
16474,"LEVY, ETHAN",CLERK CITY COUNCIL,CITY COUNCIL,F,Hourly,35.0,NaN,$10.00,NaN,10.0

***How many unique Job Titles are there in the data?***

In [272]:
dataframe["Job Titles"].nunique()

1095

***What was the average Salary of the employees in each department?***

In [273]:
dataframe

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate,Salaries,H_Rate
0,"ALLISON, PAUL W",LIEUTENANT,FIRE,F,Salary,NaN,"$107,790.00",NaN,107790.0,NaN
1,"BRUNO, KEVIN D",SERGEANT,POLICE,F,Salary,NaN,"$104,628.00",NaN,104628.0,NaN
2,"COOPER, JOHN E",LIEUTENANT-EMT,FIRE,F,Salary,NaN,"$114,324.00",NaN,114324.0,NaN
3,"CRESPO, VILMA I",STAFF ASST,LAW,F,Salary,NaN,"$76,932.00",NaN,76932.0,NaN
4,"DOLAN, ROBERT J",SERGEANT,POLICE,F,Salary,NaN,"$111,474.00",NaN,111474.0,NaN
...,...,...,...,...,...,...,...,...,...,...
32653,"ZYGOWICZ, PETER J",POLICE OFFICER,POLICE,F,Salary,NaN,"$90,024.00",NaN,90024.0,NaN
32654,"ZYLINSKA, KATARZYNA",POLICE OFFICER,POLICE,F,Salary,NaN,"$48,078.00",NaN,48078.0,NaN
32655,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,F,Salary,NaN,"$87,006.00",NaN,87006.0,NaN
32656,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,F,Salary,NaN,"$93,354.00",NaN,93354.0,NaN
32657,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,F,Salary,NaN,"$115,932.00",NaN,115932.0,NaN

In [274]:
dataframe.groupby("Department")["Salaries"].mean()

Department
ADMIN HEARNG             78912.947368
ANIMAL CONTRL            66089.684211
AVIATION                 76140.018777
BOARD OF ELECTION        56051.142857
BOARD OF ETHICS          94552.500000
BUDGET & MGMT            93925.395349
BUILDINGS                98864.833534
BUSINESS AFFAIRS         80446.425000
CITY CLERK               69762.439024
CITY COUNCIL             63577.172069
COMMUNITY DEVELOPMENT    88363.257143
COPA                     98784.705882
CULTURAL AFFAIRS         87048.909091
DISABILITIES             82431.724138
DoIT                     99681.029703
FAMILY & SUPPORT         79013.588785
FINANCE                  73276.364662
FIRE                     97762.348662
GENERAL SERVICES         83095.528390
HEALTH                   85488.210938
HUMAN RELATIONS          93778.588235
HUMAN RESOURCES          79851.761194
INSPECTOR GEN            84030.666667
IPRA                     94429.285714
LAW                      84582.814404
LICENSE APPL COMM        80568.000000
MAYOR'S OFFICE           96165.512308
OEMC                     73153.778221
POLICE                   87836.025349
POLICE BOARD             86136.000000
PROCUREMENT              83278.243902
PUBLIC LIBRARY           71273.288136
STREETS & SAN            84347.775701
TRANSPORTN               89976.896061
TREASURER                88062.652174
WATER MGMNT              89894.111803
Name: Salaries, dtype: float64

***What is the job title of 'AGAR, BULENT B'?***

In [275]:
dataframe[dataframe["Name"] == "AGAR,  BULENT B"]['Job Titles']
# dataframe[dataframe['Name']=='ZYLINSKA, KATARZYNA']['Job Titles']

230    CHIEF ENGINEER OF SEWERS
Name: Job Titles, dtype: object

***What are the top most common job titles?***

In [276]:
dataframe["Job Titles"].value_counts().head(1)

Job Titles
POLICE OFFICER    9393
Name: count, dtype: int64

In [277]:
dataframe.groupby("Job Titles").count().idxmax()["Name"]

'POLICE OFFICER'

***How many people have the word 'officer' in their job title?***

In [278]:
# dataframe[dataframe["Job Titles"]]
def search_string(title, search_word):
    if search_word.lower() in title.lower():
        return True
    return False

In [279]:
dataframe["Job Titles"].apply(lambda x: search_string(x, "officer")).sum()

np.int64(11101)

In [280]:
sum(dataframe["Job Titles"].apply(lambda x: search_string(x, "officer")))

11101

***Save the final dataframe to a csv file***

In [281]:
dataframe.to_csv("pandas_dataframe.csv")